export default [
    {
        icon: 'icon-search',
        title: 'Анализ конкурентов',
        text: 'Мы анализируем ваших конкурентов и определяем, что вам нужно, чтобы их догнать.'
    },
    {
        icon: 'icon-attention',
        title: 'Улучшение сайта',
        text: 'Мы находим и устраняем все технические ошибки сайта, которые мешают его продвижению.'
    },
    {
        icon: 'icon-comment',
        title: 'Сбор запросов для продвижения',
        text: 'Мы собираем запросы, подходящие под ваши услуги или товары.'
    },
    {
        icon: 'icon-strategy',
        title: 'Стратегия продвижения',
        text: 'Мы определяем количество и качество текстов и ссылок, необходимых для продвижения вашего сайта в топ.'
    },
]
