import React from 'react'
import DocumentPageHOC from './DocumentPageHOC'

function PrivacyPage() {
    return (
        <DocumentPageHOC>
            <article>
                <h2>Соглашение о конфиденциальности использования персональных данных</h2>
                <p>Настоящая Политика конфиденциальности действует в отношении любой информации, которую Администрация Ресурса <a href="https://seobull.ru" target="_blank" rel="noopener noreferrer">https://seobull.ru</a> может получить от Пользователей.</p>
                <p>Использование Ресурса означает безоговорочное согласие Пользователя с настоящей Политикой конфиденциальности и условиями обработки его персональных данных; в случае несогласия с этими условиями Пользователь должен незамедлительно покинуть страницу Ресурса.</p>

                <ol>
                    <li className="list-style-impo"><span>Основные положения</span></li>
                    <ol>
                        <li><span>В рамках настоящей Политики конфиденциальности обрабатываются следующие данные:</span></li>
                        <ol>
                            <li><span>Персональная информация, которую Пользователь предоставляет о себе при регистрации на Ресурсе или в процессе использования Услуг. В качестве такой информации, может быть рассмотрена и информация о третьих лицах, если Пользователь представляет интересы сторонних лиц и действует в чужом интересе.</span></li>
                            <li><span>Данные, которые автоматически получает Ресурс в процессе его использования с помощью установленного на устройстве Пользователя программного обеспечения, в том числе: IP-адрес, данные файлов cookie, информация о браузере Пользователя, технические характеристики оборудования и программного обеспечения, используемых Пользователем, дата и время доступа к Ресурсу, адреса запрашиваемых страниц и иная подобная информация.</span></li>
                            <li><span>Иная информация о Пользователе, которую он счел возможным или необходимым предоставить для целей взаимодействия с Ресурсом.</span></li>
                        </ol>
                        <li><span>Настоящая Политика применима только к информации, обрабатываемой в ходе использования Ресурса не регулирует обработку информации сайтами третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на Ресурсе.</span></li>
                        <li><span>Администрация Ресурса не проверяет достоверность информации, предоставляемой Пользователем, и не имеет возможности оценивать его дееспособность, но исходит из того, что пользователь предоставляет достоверную и достаточную персональную информацию и поддерживает эту информацию в актуальном состоянии.</span></li>
                        <li><span>Администрация Ресурса принимает необходимые и достаточные организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.</span></li>
                    </ol>
                </ol>

                <ol>
                    <li className="list-style-impo"><span>Цели обработки данных</span></li>
                    <ol>
                        <li><span>Администрация Ресурса собирает и хранит только ту персональную информацию, которая необходима для исполнения соглашений и договоров с Пользователем, за исключением случаев, когда законодательством предусмотрено обязательное хранение персональной информации в течение определенного законом срока.</span></li>
                        <li><span>Персональные данные обрабатываются с целью:</span></li>
                        <ol>
                            <li><span>Идентификации Пользователей и оказания услуг;</span></li>
                            <li><span>Поддержания связи с Пользователем, в том числе направление всевозможных уведомлений и запросов, касающихся использования Ресурса.
Регистрируясь на Ресурсе, Пользователь автоматически дает согласие на получение рассылки Ресурса (по доступным каналам связи), о чем ему сообщается в первом же письме с уведомлением об успешной регистрации. Отказаться от рассылки можно направив письмо соответствующим требованием на адрес электронной почты: <a href="mailto:contact@seobull.ru">contact@seobull.ru</a>. Администрация Ресурса обязана рассмотреть и удовлетворить такое письмо в срок не превышающий 21 (двадцать один) календарный день с даты его получения.</span></li>
                            <li><span>Улучшения качества работы Ресурса;</span></li>
                            <li><span>Таргетирования рекламных материалов и проведения статистических и иных исследований на основе обезличенных данных.</span></li>
                        </ol>
                    </ol>
                </ol>


                <ol>
                    <li className="list-style-impo"><span>Условия обработки данных  и их передачи третьим лицам</span></li>
                    <ol>
                        <li><span>Ресурс не ограничен в применении способов их обработки полученной информации.</span></li>
                        <li><span>В отношении персональных данных Пользователей сохраняется конфиденциальность, кроме общедоступных сведений.</span></li>
                        <li><span>Передача такой информации третьим лицам возможна в следующих случаях:</span></li>
                        <ol>
                            <li><span>Получено согласие Пользователя на такие действия;</span></li>
                            <li><span>Передача необходима исполнения договора с Пользователем;</span></li>
                            <li><span>Передача предусмотрена российским законодательством в рамках установленной законодательством процедуры;</span></li>
                            <li><span>Такая передача происходит в рамках продажи бизнеса (полностью или в части), при этом к приобретателю переходят все обязательства по соблюдению условий настоящей Политики конфиденциальности;</span></li>
                            <li><span>В целях обеспечения защиты прав и законных интересов Ресурса, если Пользователь нарушает свои обязательства;</span></li>
                            <li><span>При обработке персональных данных Пользователя путем ее обезличивания для проведения маркетинговых исследований (в том числе и третьими лицами).</span></li>
                        </ol>
                        <li><span>При обработке персональных данных Пользователей администрация Ресурса руководствуется Федеральным законом РФ «О персональных данных».</span></li>
                    </ol>
                </ol>

                <ol>
                    <li className="list-style-impo"><span>Изменение, удаление и хранение персональных данных</span></li>
                    <ol>
                        <li><span>Пользователь может в любой момент изменить (обновить, дополнить) предоставленную им персональную информацию полностью или частично.</span></li>
                        <li><span>Пользователь не может удалить предоставленную информацию, и отозвать свое согласие на обработку данных до выполнения взаимных обязательств с администрацией Ресурса.</span></li>
                        <li><span>Администрация ресурса вправе хранить измененную или удаленную Пользователем информацию весь срок, установленный законодательством, и передать такую информацию в соответствии с законодательно установленной процедурой государственному органу.</span></li>
                    </ol>
                </ol>


                <ol>
                    <li className="list-style-impo"><span>Положение о Cookie</span></li>
                    <ol>
                        <li><span>Файлы cookie, могут использоваться Ресурсом для предоставления Пользователям персонализированных сервисов, для таргетирования рекламы, которая показывается Пользователю, в статистических и исследовательских целях.</span></li>
                        <li><span>Пользователь осознает и принимает, что оборудование и программное обеспечение, используемые им для посещения сайтов в сети интернет, могут обладать функцией запрещения операций с файлами cookie, а также удаления ранее полученных файлов cookie.</span></li>
                        <li><span>Структура файла cookie, его содержание и технические параметры определяются автоматически и могут изменяться без предварительного уведомления Пользователей, однако не содержат персональных данных о Пользователях.</span></li>
                        <li><span>Счетчики, размещенные на Ресурсе, могут использоваться для анализа файлов cookie Пользователей, для сбора и обработки статистической информации об использовании Ресурса, а также для обеспечения его работоспособности. Технические параметры работы счетчиков определяются Ресурсом и могут изменяться без предварительного уведомления Пользователя.</span></li>
                    </ol>
                </ol>

                <ol>
                    <li className="list-style-impo"><span>Изменения и дополнения </span></li>
                    <ol>
                        <li><span>Администрация Ресурса имеет право по своей инициативе вносить изменения и дополнения в настоящую Политику конфиденциальности. При внесении изменений в актуальной редакции указывается дата последнего обновления. Новая редакция Политики вступает в силу с момента ее размещения, если не предусмотрено иное.</span></li>
                        <li><span>Настоящая Политика конфиденциальности регулируется действующим законодательством Российской Федерации, а споры, возникающие в ходе ее применения подлежат рассмотрению судами Российской Федерации.</span></li>
                    </ol>
                </ol>

                <ol>
                    <li className="list-style-impo"><span>Обратная связь. Вопросы и предложения</span></li>
                    <ol>
                        <li><span>Все предложения или вопросы по поводу настоящей Политики Пользователи вправе направлять по адресу: <a href="mailto:contact@seobull.ru">contact@seobull.ru</a>.</span></li>
                    </ol>
                </ol>

            </article>
        </DocumentPageHOC>
    )
}

export default PrivacyPage
